* Domain names and IP addresses list

Vstupní tabulka obsahuje seznam domén a jmen v nich.
 #+NAME: domains
 | domain | Subdomény        |
 |--------+------------------|
 | cz     | lupa,root,seznam |
 | nic.cz | ntp,www          |

The table can be expanded to a list:
#+begin_src emacs-lisp :var names=domains :results list
(domainlist-to-dnsnames names)
#+end_src

#+RESULTS:
- cz
- lupa.cz
- root.cz
- seznam.cz

#+NAME: shodan-get-ips
#+begin_src emacs-lisp :var names=domains
  (cl-list* '(name IP) 'hline
	    (cl-sort (resolve-names (domainlist-to-dnsnames names)) 'ip-smaller :key 'cadr))
#+end_src

#+RESULTS: shodan-get-ips
| name       |             IP |
|------------+----------------|
| ntp.nic.cz | 217.31.202.100 |
| www.nic.cz |  217.31.205.50 |
| nic.cz     |  217.31.205.50 |

Get Shodan information on IP addresses:
#+NAME: shodan-get-json
#+begin_src emacs-lisp :var hosts=shodan-get-ips[,1] :results silent
(shodan-get-hosts (cl-remove-duplicates hosts :test 'equal))
#+end_src

** SSL/TLS servery
#+NAME: json-extract
 #+begin_src emacs-lisp :var dir="." :var datapath='ssl
       (cl-list* (cadr (assoc datapath shodan-json-path-alist)) 'hline
		  (mapcar (lambda (a)
			    (cons (car (cl-find (car a) names-cache :key 'cadr :test 'equal)) a))
	  (mapcan (lambda (file)
		    (message "%s" file)
		    (shodan-get-data-from-file file (cddr (assoc datapath shodan-json-path-alist))))
		  (directory-files "." t "\.json$" t))))
 #+end_src

#+RESULTS: json-extract
 | Hostname   |             IP | Port | Subject CN    | Issuer CN                  |
 |------------+----------------+------+---------------+----------------------------|
 | root.cz    | 91.213.160.188 |  443 | root.cz       | Let's Encrypt Authority X3 |
 | lupa.cz    | 91.213.160.123 |  443 | lupa.cz       | Let's Encrypt Authority X3 |
 | seznam.cz  |    77.75.77.53 |  443 | www.seznam.cz | Let's Encrypt Authority X3 |
 | www.nic.cz |  217.31.205.50 |  443 | nic.cz        | Let's Encrypt Authority X3 |

